getSMSDeliveryStatus.xml

<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:v2="http://www.huawei.com.cn/schema/common/v2_1"
	xmlns:loc="http://www.csapi.org/schema/parlayx/sms/send/v2_2/local">
	<soapenv:Header>
		<v2:RequestSOAPHeader>
			<v2:spId>602078</v2:spId>
			<v2:spPassword>v0sZkh5YiXo4FAN84w9dQOdkTDpu2303XVyB2thNi1U=</v2:spPassword>
			<v2:serviceId>35000001000001</v2:serviceId>
			<v2:timeStamp>20181210021223</v2:timeStamp>
		</v2:RequestSOAPHeader>
	</soapenv:Header>
	<soapenv:Body>
<loc:getSmsDeliveryStatus>
	<loc:requestIdentifier>100005200401110225063201000041</loc:requestIdentifier>
</loc:getSmsDeliveryStatus>
	</soapenv:Body>
</soapenv:Envelope>